In [115]:
import numpy as np
import pandas as pd

df = pd.read_csv('file.csv', parse_dates=['User birthday'])
df['User gender'] = df['User gender'].fillna('unknown')
df.head()

  User birthday  Number User gender
0    1967-06-14       0     unknown
1    1994-07-28       0     unknown
2    2001-06-27       0     unknown
3    1997-05-15       0     unknown
4    1992-11-21       0     unknown

In [116]:
def age(born):
    today = date.today()
    return today.year - born.year - ((today.month, 
                                      today.day) < (born.month, 
                                                    born.day))

df['Age'] = df['User birthday'].apply(age)
df

   User birthday  Number User gender  Age
0     1967-06-14       0     unknown   54
1     1994-07-28       0     unknown   27
2     2001-06-27       0     unknown   20
3     1997-05-15       0     unknown   24
4     1992-11-21       0     unknown   29
..           ...     ...         ...  ...
62    2001-09-06       0     unknown   20
63    1981-11-11       0     unknown   40
64    1990-06-04       0     unknown   31
65    1992-09-23       0     unknown   29
66    2001-03-20       0     unknown   21

[67 rows x 4 columns]

In [117]:
df['bins'] = pd.cut(df['Age'], bins=[0, 17, 25, 30, 35, 40, 45, 50, 55, 60, 100])
df['bins'] = df.bins.astype(str)
# mask = (df['bins'] == '(50, 55]') df[df['Age'] == 18]
df

   User birthday  Number User gender  Age      bins
0     1967-06-14       0     unknown   54  (50, 55]
1     1994-07-28       0     unknown   27  (25, 30]
2     2001-06-27       0     unknown   20  (17, 25]
3     1997-05-15       0     unknown   24  (17, 25]
4     1992-11-21       0     unknown   29  (25, 30]
..           ...     ...         ...  ...       ...
62    2001-09-06       0     unknown   20  (17, 25]
63    1981-11-11       0     unknown   40  (35, 40]
64    1990-06-04       0     unknown   31  (30, 35]
65    1992-09-23       0     unknown   29  (25, 30]
66    2001-03-20       0     unknown   21  (17, 25]

[67 rows x 5 columns]

In [118]:
df2 = df.groupby(['bins','User gender']).sum()
df3 = df2.reset_index()
df3

         bins User gender  Number  Age
0    (17, 25]     unknown       0  271
1    (25, 30]     unknown       0  518
2    (30, 35]     unknown       0  352
3    (35, 40]        male       1   37
4    (35, 40]     unknown       0  270
5    (40, 45]     unknown       0  390
6    (45, 50]     unknown       0   47
7    (50, 55]     unknown       0  213
8    (55, 60]     unknown       0   60
9   (60, 100]      female       1   63
10  (60, 100]     unknown       0  127

In [119]:
df3.to_csv('file fixed.csv')